---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectShapeReferenceOptions
source: html/6c709bd4-1765-f7b9-31a1-f6384bd6835f.htm
---
# DirectShapeReferenceOptions Members

Constructs a new DirectShapeRefOptions instance with default settings.